{
  "world": {
    "top_stories": [
      {
        "id": "8f0af812352e",
        "title": "Pentagon fires intelligence agency chief after Iran attack assessment",
        "url": "https://www.bbc.com/news/articles/c2dj217z2w6o?at_medium=RSS&at_campaign=rss",
        "description": "The firing comes just weeks after a White House rebuke of a leaked intelligence report assessing the impact of US strikes on Iran.",
        "source": "BBC World News",
        "published": "2025-08-23T16:24:47+00:00",
        "fetched_at": "2025-08-24T00:14:47.716661+00:00",
        "category": "world",
        "scraped_content": "Pentagon fires intelligence agency chief after Iran attack assessment 8 hours ago Share Save Rachel Muller-Heyndyk BBC News Share Save Reuters Lt Gen Jeffrey Kruse will no longer serve as head of the US Defense Intelligence Agency (DIA) US defence secretary Pete Hegseth has fired the Pentagon's intelligence agency chief, just weeks after a White House rebuke of a review assessing the impact of American strikes on Iran. Lt Gen Jeffery Kruse will no longer serve as head of US Defence Intelligence Agency (DIA), the Pentagon said in a statement. Two other senior military commanders have also been ousted by the Pentagon. The defence department has not offered any immediate explanation on the firings. In June, President Donald Trump had pushed back strongly on a leaked DIA report that found that attacks on Iran had set back its nuclear programme by months only. The White House declared the agency's assessment \"flat out wrong\". Trump had declared the nuclear sites in Iran \"completely destroyed\", and had accused the media of \"an attempt to demean one of the most successful military strikes in history\". Speaking at the Nato summit at the time, Hegseth had said that the report was made on \"low intelligence\" and that the FBI was probing the leak. Kruse's exit was first reported by the Washington Post. The DIA is part of the Pentagon and specialises in military intelligence to support operations. It collects large amounts of technical intelligence, but is distinct from other agencies like the CIA. It is understood that Hegseth had also ordered the removal of the chief of US Naval reserves and the commander of Naval Special Warfare Command, an anonymous source told Reuters on Friday. In  a statement, US Senator Mark Warner warned that Kruse's sacking was a sign that Trump had a \"dangerous habit of treating intelligence as a loyalty test rather than a safeguard for our country\". Trump has removed a number of officials whose analysis have been seen to be at odds with the president"
      },
      {
        "id": "66ae01d533b4",
        "title": "Ghislaine Maxwell denies seeing 'inappropriate' conduct by Trump",
        "url": "https://www.bbc.com/news/articles/cdd3pe6189go?at_medium=RSS&at_campaign=rss",
        "description": "Maxwell was interviewed after pressure on Trump to release information about whether prominent figures were involved in Jeffrey Epstein's crimes.",
        "source": "BBC World News",
        "published": "2025-08-23T20:24:11+00:00",
        "fetched_at": "2025-08-24T00:14:47.716699+00:00",
        "category": "world",
        "scraped_content": "Ghislaine Maxwell denies seeing 'inappropriate' conduct by Trump 4 hours ago Share Save Bernd Debusmann Jr BBC News, White House Share Save Getty Images Maxwell denied many of the theories that have become focal points of conspiracy theories about the Epstein case. Ghislaine Maxwell, the jailed associate of sex offender Jeffrey Epstein, has told US officials she did not witness any inappropriate conduct by Donald Trump or former President Bill Clinton. The Trump administration has faced pressure to disclose information about Epstein, who the US president had been friendly with. Maxwell was interviewed from prison in July and, according to the newly released transcript, told Deputy Attorney General Todd Blanche that a much-discussed \"client list\" does not exist. The interview outraged the family of Virginia Giuffre - a prominent Epstein accuser who died by suicide earlier this year - who say the government has given Maxwell \"a platform to rewrite history\". Maxwell is seeking a pardon from Trump and has been accused of lying to federal officials. Shortly after the interview with Blanche - who previously worked as Trump's personal attorney - she was moved from a Florida prison to a new minimum-security facility in Texas .  It is unclear why the move was made. She is currently serving a 20-year sentence in a sex-trafficking scheme, and has petitioned the US Supreme Court to overturn her conviction. Her lawyer has said they would \"welcome\" a pardon from the president. She also called allegations of Prince Andrew having sexual relations with an underage girl in Maxwell's home \"mind-blowingly not conceivable\". Although the name of the girl was redacted, it was clear from the context that Maxwell was discussing Giuffre, who had claimed she was paid to have sex with the prince in Maxwell's house. An infamous photo shows the three of them together when she was 17. The prince settled with Giuffre in 2022 , but denied liability. \"I believe it's literally a fake photo,\" Maxwell "
      },
      {
        "id": "4e36eeae2bef",
        "title": "North Korean leader oversees new missile test, state media says",
        "url": "https://www.bbc.com/news/articles/cj3lp47nxdjo?at_medium=RSS&at_campaign=rss",
        "description": "Two new air defence missiles with \"superior combat capability\" have been fired in a test observed by Kim Jong Un.",
        "source": "BBC World News",
        "published": "2025-08-23T23:51:33+00:00",
        "fetched_at": "2025-08-24T00:14:47.716729+00:00",
        "category": "world",
        "scraped_content": "North Korean leader oversees new missile test, state media says 23 minutes ago Share Save Jack Burgess BBC News Share Save Getty Images North Korean state media has said two new air defence missiles have been fired in a test overseen by the country's leader Kim Jong Un. The weapons had \"superior combat capability\" and used a \"unique technology\", the Korean Central News Agency (KCNA) said, without adding details. The launches, carried out on Saturday, \"proved that the technological features of two types of projectiles are very suitable for destroying various aerial targets\" including drones and cruise missiles, KCNA said. The test comes hours after South Korea confirmed it fired warning shots on Tuesday at North Korean soldiers who briefly crossed the Demilitarised Zone (DMZ) separating the countries. United Nations Command said about 30 North Korean troops crossed the heavily-fortified border between the north and south, Yonhap News Agency said. Pyongyang responded by accusing Seoul of a \"deliberate provocation\". South Korea and the United States have been conducting large-scale joint military exercises in the region since Monday. US President Donald Trump is due to meet South Korea's President Lee Jae Myung at a summit on Monday in Washington. The newly-elected South Korean president had campaigned on improving inter-Korean ties . However, Kim's sister has since rebuffed efforts towards reconciliation made by Lee's government. Kim also earlier this month condemned the US and South Korea's joint military drills, describing them as \"most hostile and confrontational\". The North Korean leader vowed to speed up his aim to increase the country's stash of nuclear weapons. In January, North Korea claimed to fire a new intermediate-range ballistic missile tipped with a hypersonic warhead, which it said \"will reliably contain any rivals in the Pacific region\". Senior South Korean officials have raised concerns about North Korea receiving Russian missile technology in exchang"
      }
    ],
    "quick_reads": [
      {
        "id": "a11e42872e84",
        "title": "Man who alleged hundreds were raped and buried in Indian temple town arrested",
        "url": "https://www.bbc.com/news/articles/cgm2z9zjgx7o?at_medium=RSS&at_campaign=rss",
        "description": "The former temple cleaner's startling claims threw the town of Dharmasthala in Karnataka into turmoil.",
        "source": "BBC World News",
        "published": "2025-08-23T09:31:01+00:00",
        "fetched_at": "2025-08-24T00:14:47.716757+00:00",
        "category": "world"
      },
      {
        "id": "e9a66904d43d",
        "title": "Turkish first lady appeals to Melania Trump over Gaza children",
        "url": "https://www.bbc.com/news/articles/cn47ppy382wo?at_medium=RSS&at_campaign=rss",
        "description": "In a letter, Turkey's first lady asks Mrs Trump to appeal to Israel to end the war in Gaza.",
        "source": "BBC World News",
        "published": "2025-08-23T21:13:56+00:00",
        "fetched_at": "2025-08-24T00:14:47.716785+00:00",
        "category": "world"
      },
      {
        "id": "0fb02234935a",
        "title": "UK's Chagos Islands deal 'significant victory', says Pope",
        "url": "https://www.bbc.com/news/articles/cx2p1k1r2glo?at_medium=RSS&at_campaign=rss",
        "description": "Pope Leo XIV said he hoped Mauritian authorities would ensure the refugees are able to return home.",
        "source": "BBC World News",
        "published": "2025-08-23T21:35:11+00:00",
        "fetched_at": "2025-08-24T00:14:47.716812+00:00",
        "category": "world"
      },
      {
        "id": "6b2f901f1c7f",
        "title": "US government wants to deport Kilmar Ábrego García to Uganda",
        "url": "https://www.bbc.com/news/articles/cewyppww09jo?at_medium=RSS&at_campaign=rss",
        "description": "His lawyers accuse the government of trying to \"coerce\" him to plead guilty by threatening to deport him \"halfway across the world\".",
        "source": "BBC World News",
        "published": "2025-08-23T20:32:30+00:00",
        "fetched_at": "2025-08-24T00:14:47.716842+00:00",
        "category": "world"
      },
      {
        "id": "27d624198e1b",
        "title": "Emily in Paris assistant director dies ‘suddenly’ during filming",
        "url": "https://www.bbc.com/news/articles/crm4ppe9x31o?at_medium=RSS&at_campaign=rss",
        "description": "Local media named the man as 47-year-old Diego Borella, an assistant director on the show.",
        "source": "BBC World News",
        "published": "2025-08-23T16:12:59+00:00",
        "fetched_at": "2025-08-24T00:14:47.716876+00:00",
        "category": "world"
      }
    ]
  },
  "tech": {
    "top_stories": [
      {
        "id": "ab19209854b9",
        "title": "OpenAI warns against SPVs and other ‘unauthorized’ investments",
        "url": "https://techcrunch.com/2025/08/23/openai-warns-against-spvs-and-other-unauthorized-investments/",
        "description": "OpenAI isn't the only AI company looking to crack down on SPVs.",
        "source": "TechCrunch",
        "published": "2025-08-23T20:26:46+00:00",
        "fetched_at": "2025-08-24T00:14:51.343135+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Posted: Ina new blog post, OpenAI warns against “unauthorized opportunities to gain exposure to OpenAI through a variety of means,” including special purpose vehicles, known as SPVs. “We urge you to be careful if you are contacted by a firm that purports to have access to OpenAI, including through the sale of an SPV interest with exposure to OpenAI equity,” the company writes. The blog post acknowledges that “not every offer of OpenAI equity […] is problematic” but says firms may be “attempting to circumvent our transfer restrictions.” “If so, the sale will not be recognized and carry no economic value to you,” OpenAI says. Investors have increasingly used SPVs (which pool money for one-off investments) as away to buy into hot AI startups, prompting other VCs tocriticize themas a vehicle for “tourist chumps.” Business Insider reports that OpenAI isn’t the only major AI company looking to crack down on SPVs, withAnthropic reportedly telling Menlo Venturesit must use its own capital, not an SPV, to invest in an upcoming round. Topics Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Subscribe for the industry’s biggest tech news Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility is your destination for transportation news and insight. Startups are the core of TechCrunch, so get our best coverage delivered weekly. Provides movers a"
      },
      {
        "id": "fe8369aec621",
        "title": "Amazon AGI Labs chief defends his reverse acquihire",
        "url": "https://techcrunch.com/2025/08/23/amazon-agi-labs-chief-defends-his-reverse-acquihire/",
        "description": "The former Adept CEO said he hopes to be \"remembered more as \"an AI research innovator\" than a \"a deal structure innovator.\"",
        "source": "TechCrunch",
        "published": "2025-08-23T20:01:04+00:00",
        "fetched_at": "2025-08-24T00:14:51.343169+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Posted: When Amazonhired the founders of AI startup Adeptlast year, it was one of the first examples of what became known as a reverse acquihire — a deal where a large company hires key startup team members and licenses its technology, rather than acquiring the startup outright. Adept’s co-founder and former CEO David Luan subsequently becamethe head of Amazon’s new AGI Lab, and whileLuan’s recent interviewwith The Verge is ostensibly focused on Amazon’s vision for AI agents, reporter Alex Heath also asked him aboutthe reverse acquihire trend. Luan replied that hopes to be “remembered more as being an AI research innovator rather than a deal structure innovator,” — but from his perspective, it’s “perfectly rational” for companies like Amazon to “put together critical mass on both talent and compute right now.” As for why he was willing to leave his startup for Amazon, Luan said he wasn’t interested in turning Adept into a “an enterprise company that only sells small models,” because he wanted to solve “the four crucial remaining research problems left to AGI.” “Every single one of them is going to require two-digit billion-dollar clusters to go run it,” he said. “How else am I […] going to have the opportunity to go do that?” Topics Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Subscribe for the industry’s biggest tech news Every weekday and Sunday, you can get the "
      },
      {
        "id": "0cfb16988867",
        "title": "The Trump administration’s big Intel investment comes from already awarded grants",
        "url": "https://techcrunch.com/2025/08/23/the-trump-administrations-big-intel-investment-comes-from-already-awarded-grants/",
        "description": "While Intel says the government is making an “$8.9 billion investment in Intel common stock,” the administration does not appear to be committing new funds.",
        "source": "TechCrunch",
        "published": "2025-08-23T16:07:30+00:00",
        "fetched_at": "2025-08-24T00:14:51.343203+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Intel officiallyannounced an agreementwith President Donald Trump’s administration on Friday afternoon, following Trump’s statement thatthe government would be taking a 10% stakein the struggling chipmaker. While Intel says the government is making an “$8.9 billion investment in Intel common stock,” the administration does not appear to be committing new funds. Instead, it’s simply making good on what Intel described as “grants previously awarded, but not yet paid, to Intel.” Specifically, the $8.9 billion is supposed to come from $5.7 billionawarded-but-not-paid to Intelunder the Biden administration’s CHIPS Act, as well as $3.2 billion alsoawarded by the Biden administrationthrough the Secure Enclave program. Ina post on his social network Truth Social, Trump wrote, “The United States paid nothing for these shares.” Nonetheless, he described this as “a great Deal for America and, also, a great Deal for INTEL.” Trump has been critical of the CHIPS Act,calling it a “horrible, horrible thing”and calling on House Speaker Mike Johnson to “get rid” of it. Ina regulatory filingin June, Intel said that while it had already received $2.2 billion in CHIPS Act funding, it had subsequently requested an additional $850 million in reimbursement that the government had not yet paid. According to The New York Times, some bankers and lawyers believe the CHIPS Act may not allow the government to convert its grants to equity, opening this deal to potential legal challenges. In addition to his targeting of the CHIPS Act, earlier this month Trump also accused "
      }
    ],
    "quick_reads": [
      {
        "id": "e31444575038",
        "title": "Why wind farms attract so much misinformation and conspiracy theory",
        "url": "https://arstechnica.com/science/2025/08/why-wind-farms-attract-so-much-misinformation-and-conspiracy-theory/",
        "description": "If you think climate change is a hoax, you might believe wind turbines poison groundwater.",
        "source": "Ars Technica",
        "published": "2025-08-23T11:07:40+00:00",
        "fetched_at": "2025-08-24T00:14:53.168543+00:00",
        "category": "tech"
      },
      {
        "id": "525ce57397e2",
        "title": "An inner-speech decoder reveals some mental privacy issues",
        "url": "https://arstechnica.com/science/2025/08/an-inner-speech-decoder-reveals-some-mental-privacy-issues/",
        "description": "Words you'll never speak still cause activity in the brain's speech centers.",
        "source": "Ars Technica",
        "published": "2025-08-23T11:00:57+00:00",
        "fetched_at": "2025-08-24T00:14:53.168582+00:00",
        "category": "tech"
      }
    ]
  },
  "finance": {
    "top_stories": [
      {
        "id": "d8680098ca07",
        "title": "What wealthy parents need to know about giving real estate to their kids",
        "url": "https://www.cnbc.com/2025/08/23/real-estate-wealth-transfer-family.html",
        "description": "Lawyers to the rich share tips on how to pass down homes without sibling drama and a massive tax bill.",
        "source": "CNBC Finance",
        "published": "2025-08-23T12:00:02+00:00",
        "fetched_at": "2025-08-24T00:14:57.618917+00:00",
        "category": "finance",
        "scraped_content": " A version of this article first appeared in CNBC's Inside Wealth newsletter with Robert Frank, a weekly guide to the high-net-worth investor and consumer.Sign upto receive future editions, straight to your inbox. Thegreat wealth transferis leading to a great real estate transfer, with up to $25 trillion in real estate owned by older generations that could get passed down — and fought over — in their families. According to Cerulli Associates, $105 trillion is expected to be passed down by baby boomers and older generations by 2048. Real estate, including primary and vacation homes, as well as investment properties, is expected to be a large component. The silent generation and baby boomers own nearly $25 trillion in real estate combined, according to the Federal Reserve. Yet with property comes conflict. Wealth advisors say handing down real estate is increasingly filled with both financial and emotional pitfalls for families, ranging from taxes and maintenance costs to disputes over ownership and usage. The straightforward solution is just to sell it and divide the proceeds. \"Some people want to retain the house and other children don't,\" said BNY Wealth's Jere Doyle. \"I can tell you, as a practical matter, there's going to be fights. There's going to be disagreements. You're not going to have the perfect situation.\" But lawyers and wealth planners say there are measures families can take to more effectively pass down real estate to minimize taxes, costs and family battles. Here are five secrets to successful real estate inheritances, whether it's an apartment on Park Avenue, a beach house on the Vineyard or a ranch in Montana. Passing down vacation homes is the most fraught, said Elisa Rizzo of J.P. Morgan Private Bank. Her clients often downsize their primary residences later in life, but families stay attached to their second homes. \"That vacation home, often for our families that are very mobile, becomes the centering place,\" said Rizzo, head of family office a"
      },
      {
        "id": "5ad322da9f70",
        "title": "Higher tariffs are kicking in. Here's what Walmart and other retailers said about their impact",
        "url": "https://www.cnbc.com/2025/08/22/retail-earnings-walmart-target-home-depot-discuss-tariffs.html",
        "description": "Consumer spending has largely stayed strong so far and the pinch from higher duties hasn't been as severe as some companies had feared.",
        "source": "CNBC Finance",
        "published": "2025-08-23T21:36:25+00:00",
        "fetched_at": "2025-08-24T00:14:57.619017+00:00",
        "category": "finance",
        "scraped_content": " In this article As some of the biggest names in retail, includingWalmartandHome Depot, delivered earnings results in recent weeks, they updated Wall Street on how they and their shoppers are responding to PresidentDonald Trump's wave of tariff increases. The takeaway? Tariff costs are rising for retailers, and they've had to get creative to avoid widespread price hikes. Yet consumer spending has largely stayed strong so far — and the pinch from higher duties hasn't been as severe as some companies had feared. Compared with their concerns in the spring, retail executives struck a measured tone and said they don't expect their costs, or customers' prices, to jump dramatically. Walmart hadgiven one of the strongest warningsin May, as CFO John David Rainey said he expected some prices to rise during the summer.In an interview with CNBC on Thursday, however, Rainey said the nation's biggest retailerhas raised priceson some items, but in other parts of its stores has kept prices down or expanded discounts. \"There are certainly areas where we have fully absorbed the impact of higher tariff costs,\" he said. \"There are other areas where we've had to pass some of those costs along. But when you look across the basket of items, we're certainly trying to keep prices as low as we can.\" Scot Ciccarelli, a retail analyst for Truist, said retailers are raising prices \"but not nearly to the degree that might have been expected in early April\" when Trump first announced his steep tariffs on dozens of countries. \"Most of the companies are kind of downplaying the impact of tariffs,\" he said. \"They've all talked about substantial mitigation efforts, whether that is diversifying sourcing, whether that is pushing price back to vendors.\" Here are three takeaways from a busy couple of weeks of retail earnings. The drumbeat of steady, but selective, U.S. consumer spending continued this quarter. At Walmart, the nation's largest grocer by revenue, sales of private-label items, which tend to "
      }
    ],
    "quick_reads": []
  }
}