{
  "world": {
    "top_stories": [
      {
        "id": "1713e483bae9",
        "title": "Netanyahu attacks Palestinian recognition as dozens walk out of UN speech",
        "url": "https://www.bbc.com/news/articles/cderxxylpzdo?at_medium=RSS&at_campaign=rss",
        "description": "Officials and diplomats left the auditorium in protest as the Israeli leader took the stage, leaving large parts of the hall empty.",
        "source": "BBC World News",
        "published": "2025-09-26T16:41:44+00:00",
        "fetched_at": "2025-09-27T01:52:20.600056+00:00",
        "category": "world",
        "scraped_content": "Netanyahu attacks Palestinian recognition as dozens walk out of UN speech 9 hours ago Share Save Tom Bennett Jerusalem Share Save A walk-out and speakers in Gaza: See how Netanyahu's UN speech unfolded Israeli Prime Minister Benjamin Netanyahu has attacked the recognition of a Palestinian state by multiple Western countries during a combative speech at the UN General Assembly. Netanyahu labelled the recognition moves a \"mark of shame\" that sent the message \"murdering Jews pays off\". Dozens of officials and diplomats staged a walk-out as he took to the podium, leaving large parts of the conference hall empty. Outside, protesters against Israel's war in Gaza gathered in Times Square. Israel has come under huge international pressure over its military action in Gaza, culminating in the UK, France, Canada, Australia and other countries recognising the State of Palestine this week. In his opening remarks, Netanyahu displayed a map labelled \"The Curse\" that he said showed Iranian proxy groups across the Middle East. He then highlighted Israeli military operations across the past year against Hezbollah in Lebanon, the Houthis in Yemen, Hamas in Gaza, and Iran. He thanked US President Donald Trump for American involvement in bombing Iran's Fordo nuclear site in June, and drew parallels between Hamas's 7 October 2023 attack on Israel and the 9/11 attack on the US."
      },
      {
        "id": "e251aa751d32",
        "title": "Elon Musk and Prince Andrew named in new Epstein files",
        "url": "https://www.bbc.com/news/articles/cwyl8j1we0lo?at_medium=RSS&at_campaign=rss",
        "description": "The documents by the estate of convicted paedophile financier Jeffrey Epstein were released by Congressional Democrats.",
        "source": "BBC World News",
        "published": "2025-09-26T21:15:39+00:00",
        "fetched_at": "2025-09-27T01:52:20.600107+00:00",
        "category": "world",
        "scraped_content": "Elon Musk and Prince Andrew named in new Epstein files 5 hours ago Share Save Jaroslav Lukiv , Chi Chi Izundu Investigations correspondent and Olivia Davies Share Save Getty Images Elon Musk has not publicly commented on the latest development Billionaire Elon Musk and Prince Andrew are named in new files released by Congressional Democrats that relate to the late convicted sex offender and financier Jeffrey Epstein. The files turned over to the House Oversight Committee by the Jeffrey Epstein Estate appear to show that Musk had been invited to Epstein's island in December 2014. Separately a manifest for a flight from New Jersey to Florida in May 2000 names Prince Andrew among the passengers. Musk and Prince Andrew have been approached for comment. Prince Andrew has previously strenuously denied any wrongdoing. Musk has previously been quoted as saying that Epstein had invited him to the island but he had declined. The partial records are from the third batch of documents produced by the Jeffrey Epstein Estate. Democrats on the House Oversight Committee say they include phone message logs, copies of flight logs and manifests for aircrafts, copies of financial ledgers and Epstein's daily schedule."
      },
      {
        "id": "22cdd001e6d7",
        "title": "Dubai sex-trade ring boss held by police after BBC investigation",
        "url": "https://www.bbc.com/news/articles/ce84ezl461po?at_medium=RSS&at_campaign=rss",
        "description": "Charles Mwesigwa led a degrading network exploiting vulnerable women in glamorous parts of Dubai.",
        "source": "BBC World News",
        "published": "2025-09-26T15:52:35+00:00",
        "fetched_at": "2025-09-27T01:52:20.600164+00:00",
        "category": "world",
        "scraped_content": "Dubai sex-trade ring boss held by police after BBC investigation 10 hours ago Share Save Runako Celina BBC Eye Investigations Share Save Watch: Charles Mwesigwa [known locally as Abbey] filmed by an undercover reporter posing as an event organiser sourcing women for high-end parties. Warning: Contains disturbing content and graphic descriptions of sexual acts The BBC understands the boss of a degrading sex-trade ring that exploited vulnerable women in Dubai's most glamorous neighbourhoods has been detained in the United Arab Emirates. Charles \"Abbey\" Mwesigwa, who was identified in a recent BBC investigation as running the network, was filmed telling an undercover reporter he could provide women for a sex party at a starting price of $1,000 (£750). He also said the women could do \"pretty much everything\" clients wanted them to and said he was a former London bus driver. It is not clear what charges - if any - Mwesigwa is facing in the UAE and the country's authorities have not yet made a public announcement about the case. Outside of the UK you can watch on YouTube But a Dubai law firm contacted by the BBC said they had received confirmation that Mwesigwa was in custody at the Central Prison Centre in Al Awir, Dubai. They said a red notice had been issued against Mwesigwa by Interpol Uganda. A red notice is a request to police worldwide to detain someone pending extradition."
      },
      {
        "id": "8c0de1d853b2",
        "title": "What to know about James Comey's indictment and what happens next",
        "url": "https://www.bbc.com/news/articles/cj07ndrnr34o?at_medium=RSS&at_campaign=rss",
        "description": "The news puts the ex-FBI boss back in the spotlight nearly a decade after the drama of the 2016 election.",
        "source": "BBC World News",
        "published": "2025-09-26T17:23:04+00:00",
        "fetched_at": "2025-09-27T01:52:20.600211+00:00",
        "category": "world",
        "scraped_content": "What to know about James Comey's indictment and what happens next 8 hours ago Share Save Tom Geoghegan Share Save Watch: \"I'm not afraid\", says James Comey after indictment The US Department of Justice has charged James Comey with perjury over testimony he gave to Congress five years ago. The news puts the former FBI boss back in the spotlight nearly a decade after playing a key part in the drama of the 2016 election campaign. Who is James Comey? After a childhood in New York and New Jersey, the young lawyer worked for various federal prosecutors including Rudy Giuliani in the high-profile Southern District of New York in the late 1980s. He later made waves as lead prosecutor against celebrity homemaker Martha Stewart, jailed for lying about financial misconduct in 2004. He scaled the echelons of the justice department, but left for the private sector before President Barack Obama appointed him to run the FBI in 2013. His action as its director in the final weeks of the 2016 presidential election campaign, investigating Democratic candidate Hillary Clinton's use of a private email server, caused a storm. Breaking with agency norms, Mr Comey announced 11 days before polling day that he was reopening the case due to the discovery of new emails. Then a week later the case was closed again with no further action taken."
      },
      {
        "id": "0b6dae276343",
        "title": "Slovakia passes law to recognise only two sexes and restrict adoption",
        "url": "https://www.bbc.com/news/articles/c0m4kpg2nmmo?at_medium=RSS&at_campaign=rss",
        "description": "Critics are warning the change would make life more difficult for LGBT people.",
        "source": "BBC World News",
        "published": "2025-09-26T15:29:23+00:00",
        "fetched_at": "2025-09-27T01:52:20.600250+00:00",
        "category": "world",
        "scraped_content": "Slovakia passes law to recognise only two sexes and restrict adoption 10 hours ago Share Save Rob Cameron Prague Share Save Shutterstock PM Robert Fico hailed the result as a \"great dam against progressivism\" Slovakia has changed its constitution, enshrining into law recognition of only two sexes – male and female. The legal change, which passed in a knife-edge vote in parliament, also restricts adoption to married heterosexual couples and prohibits surrogate pregnancies. The constitutional amendment was defined as enshrining \"sovereignty in cultural and ethical matters\". Critics including Amnesty International have warned the change would make life more difficult for LGBT people, saying it brings the country's legal system closer to Hungary's illiberal government or Putin's Russia. Parliament's backing of the amendment came as a surprise to observers, with even the prime minister conceding as late as Thursday it might not pass. Fico's government – a coalition of populist, leftist and nationalist parties – needed at least 90 votes in the 150-seat Slovak National Council to change the constitution, but realistically only control 78 seats. However, in the end 12 opposition MPs voted with the government. The conservative opposition Christian Democrats had long been expected to lend their support, but several members of former prime minister Igor Matovic's Slovakia movement added their votes at the last minute, tipping the scales."
      }
    ],
    "quick_reads": [
      {
        "id": "bbba102df2b6",
        "title": "Assata Shakur, black liberation activist exiled in Cuba dies at 78",
        "url": "https://www.bbc.com/news/articles/cm28yrz6502o?at_medium=RSS&at_campaign=rss",
        "description": "She fled to Cuba after being convicted in the killing of a police officer but she denied shooting the officer.",
        "source": "BBC World News",
        "published": "2025-09-26T20:27:23+00:00",
        "fetched_at": "2025-09-27T01:52:20.600287+00:00",
        "category": "world"
      },
      {
        "id": "942a61328287",
        "title": "Sinclair and Nexstar to reinstate Kimmel on ABC stations",
        "url": "https://www.bbc.com/news/articles/cy7pm1jz0dlo?at_medium=RSS&at_campaign=rss",
        "description": "Viewers in Washington, DC, St Louis and Seattle will be able to watch the late night comedian's show again.",
        "source": "BBC World News",
        "published": "2025-09-26T21:54:51+00:00",
        "fetched_at": "2025-09-27T01:52:20.600323+00:00",
        "category": "world"
      },
      {
        "id": "3ad9adda3bef",
        "title": "ICE officer disciplined after shoving woman to ground in courthouse",
        "url": "https://www.bbc.com/news/articles/cn4w23yjzj1o?at_medium=RSS&at_campaign=rss",
        "description": "The Department of Homeland Security said the officer's behaviour was \"unacceptable\" and placed him on leave.",
        "source": "BBC World News",
        "published": "2025-09-26T20:16:26+00:00",
        "fetched_at": "2025-09-27T01:52:20.600364+00:00",
        "category": "world"
      },
      {
        "id": "d4f1bb79d7bc",
        "title": "Turkey abandons bid to force doner kebab rules on Europe",
        "url": "https://www.bbc.com/news/articles/cly9g9g7j36o?at_medium=RSS&at_campaign=rss",
        "description": "The case had alarmed Germany's kebab industry in particular, who make doners very differently.",
        "source": "BBC World News",
        "published": "2025-09-26T12:35:36+00:00",
        "fetched_at": "2025-09-27T01:52:20.600399+00:00",
        "category": "world"
      },
      {
        "id": "b5d54073c9bf",
        "title": "New York office gunman had low-level CTE, medical examiner finds",
        "url": "https://www.bbc.com/news/articles/cj07nv4l7m5o?at_medium=RSS&at_campaign=rss",
        "description": "Shane Tamura killed four while targeting NFL offices in July",
        "source": "BBC World News",
        "published": "2025-09-26T19:05:39+00:00",
        "fetched_at": "2025-09-27T01:52:20.600433+00:00",
        "category": "world"
      }
    ]
  },
  "tech": {
    "top_stories": [
      {
        "id": "b6f40db74040",
        "title": "Vibe coding: Hype or new reality? Only at TechCrunch Disrupt 2025",
        "url": "https://techcrunch.com/2025/09/26/discover-how-developer-tools-are-shifting-fast-with-lauri-moore-and-david-cramer-at-techcrunch-disrupt-2025/",
        "description": "Lauri Moore (Bessemer), David Cramer (Sentry), and Zach Lloyd (Warp) join the Builders Stage at TechCrunch Disrupt 2025 to debate what founders really need from their first engineering hires — and how AI tooling fits into the equation.",
        "source": "TechCrunch",
        "published": "2025-09-26T20:00:00+00:00",
        "fetched_at": "2025-09-27T01:52:24.293239+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us The idea of hiring your “first critical engineer” is getting a serious reality check atTechCrunch Disrupt 2025, October 27–29 at San Francisco’s Moscone West. JoinLauri Moore, partner atBessemer Venture Partners, andDavid Cramer, co-founder and chief product officer atSentry, andZach Lloyd, founder and CEO of Warp, on theBuilders Stagefor a candid conversation about how developer tools are reshaping early product development. Moore brings deep expertise in AI, infrastructure, and developer tooling from both the investor and founder perspectives. Cramer, who launched Sentry as an open source side project in 2012 and scaled it into a platform used by over 4 million developers, offers firsthand insights into how the right tools — and hires — can accelerate product velocity without overbuilding. Lloyd, who founded Warp to reinvent the terminal with AI-driven developer experiences, adds the perspective of a founder building for builders at the bleeding edge of coding workflows. We’ll dig into what today’s founders actually need from their first engineering hires, what AI-enabled tooling can and can’t replace, and how the entire GTM (go-to-market) and product life cycle is adapting to this new dev world. Whether you’re a founder, a CTO, or just curious if code is still king, this panel gets into the messy, tactical details of modern startup building. TechCrunch Disrupt 2025brings together 10,000+ startup founders, VC leaders, and tech innovators to tackle what’s next in tech."
      },
      {
        "id": "d1ecd7135d48",
        "title": "What’s behind the massive AI data center headlines?",
        "url": "https://techcrunch.com/2025/09/26/whats-behind-the-massive-ai-data-center-headlines/",
        "description": "This week on Equity, Anthony Ha and Max Zeff go beyond the headlines to break down what's really going on in these AI infrastructure deals.",
        "source": "TechCrunch",
        "published": "2025-09-26T19:40:24+00:00",
        "fetched_at": "2025-09-27T01:52:24.293351+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Silicon Valley flooded the news this week with headlines about wild AI infrastructure investments. Nvidia said itwould invest up to $100 billion in OpenAI. Then OpenAI said it would build outfive more Stargate AI data centerswith Oracle and Softbank, adding gigawatts of new capacity online in the coming years. And it was later revealed thatOracle sold $18 billion in bondsto pay for these data centers. On their own, each deal is dizzying in scale. But in aggregate, we see how Silicon Valley is moving heaven and Earth to give OpenAI enough power to train and serve future versions of ChatGPT. This week onEquity, Anthony Ha and I (Max Zeff) go beyond the headlines to break down what’s really going on in these AI infrastructure deals. Rather conveniently, OpenAI also gave the world a glimpse this week of a power-intensive feature it could serve more broadly if it had access to more AI data centers."
      },
      {
        "id": "05dfd5d24c66",
        "title": "Checkout.com’s new $12B valuation is a glass half-full situation",
        "url": "https://techcrunch.com/2025/09/26/checkout-coms-new-12b-valuation-is-a-glass-half-full-situation/",
        "description": "Checkout.com is boosting its valuation as part of an employee stock buy-back program, and now says it's profitable.",
        "source": "TechCrunch",
        "published": "2025-09-26T19:30:52+00:00",
        "fetched_at": "2025-09-27T01:52:24.293398+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Fintech Checkout. comannouncedon Friday that it reached a $12 billion valuation as part of an employee stock buyback program. On the one hand, very few startups ever achieve decacorn status, so $12 billion is nothing to sneeze at. It’s a valuable enough company to have landed its founder and CEOGuillaume Pousazon Forbes’ billionaire list. On the other, there was a short period of time when Checkout. com was valued ata whopping $40 billion, as part of its $1 billion Series D round closed in 2022. By the end of that year, with the venture world crashing into a bear market, it had already internallyslashed its valuation to $11 billion. And then it lowered its valuation again, to $9."
      },
      {
        "id": "77f4321d6f9d",
        "title": "Electronic Arts will reportedly be acquired for $50B",
        "url": "https://techcrunch.com/2025/09/26/electronic-arts-will-reportedly-be-acquired-for-50b/",
        "description": "The rumored buyers of EA include investors like Silver Lake and Saudi Arabia's Public Investment Fund.",
        "source": "TechCrunch",
        "published": "2025-09-26T19:25:52+00:00",
        "fetched_at": "2025-09-27T01:52:24.293436+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Posted: The video game company Electronic Arts isnearing a $50 billion saleto a group of investors including Silver Lake and Saudi Arabia’s Public Investment Fund, according to a report from The Wall Street Journal. EA is best known for its annual sports titles in franchises like Madden NFL, FIFA, and NBA Live, as well as video game series like The Sims, Battlefield, Need for Speed, and Star Wars. According to the Journal’s report, this deal could be the largest leveraged buyout in history, meaning that the deal is mostly funded with debt. After the news broke that EA could be going private, stocks jumped 15% on Friday afternoon. Topics Founders:land your investor and sharpen your pitch. Investors:discover your next breakout startup. Innovators:claim a front-row seat to the future. Join 10,000+ tech leaders at the epicenter of innovation."
      },
      {
        "id": "e33ebc6db13c",
        "title": "‘The Social Network’ sequel will focus on Haugen leaks, with Jeremy Strong as Mark Zuckerberg",
        "url": "https://techcrunch.com/2025/09/26/the-social-network-sequel-will-focus-on-haugen-leaks-with-jeremy-strong-as-mark-zuckerberg/",
        "description": "Fifteen years after \"The Social Network,\" director Aaron Sorkin is making a sequel film about Facebook called \"The Social Reckoning.\"",
        "source": "TechCrunch",
        "published": "2025-09-26T19:25:48+00:00",
        "fetched_at": "2025-09-27T01:52:24.293475+00:00",
        "category": "tech",
        "scraped_content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Fifteen years after “The Social Network,” Aaron Sorkin will write and direct a sequel film called “The Social Reckoning,” set for release on October 9, 2026. Jesse Eisenberg will not reprise his breakout role as Mark Zuckerberg, but instead will be replaced with the more sallow, serious Jeremy Strong. Best known for playing Kendall Roy in “Succession,” Strong is known for hismethod acting, a technique in which the actor tries to immerse themselves in the mental and emotional state of the character… so if Strong suddenly takes up MMA fighting and gets really excited about asocial metaversethat no one wants, then we’ll know that filming is imminent. This film won’t pick up directly where “The Social Network,” which chronicled the rise of Facebook, left off. Instead, the story centers aroundFrances Haugen(played by Mikey Madison), the former Facebook employee who leaked a massive trove ofinternal documentsto a Wall Street Journal reporter (played by Jeremy Allen White) and accused the company of prioritizing “profits over people” in 2021. Among the most damning revelations from Haugen’s leak was internal research showing that the company was well aware that Instagram was harming the mental health of teenage girls. Haugen said in congressional testimony that Facebook was “literally fanning ethnic violence” in Ethiopia, since content moderation efforts in non-English languages were under-resourced. Her leaked documents also revealed that87% of Meta’s spendingon reducing misinformation went toward English language content, though English speakers make up just 9% of users."
      }
    ],
    "quick_reads": [
      {
        "id": "828d358007a9",
        "title": "YouTube Music tests AI hosts that share trivia and commentary",
        "url": "https://techcrunch.com/2025/09/26/youtube-music-tests-ai-hosts-that-share-trivia-and-commentary/",
        "description": "YouTube Music's new AI hosts are currently being tested through YouTube Labs, the platform's new hub for AI experiments.",
        "source": "TechCrunch",
        "published": "2025-09-26T19:02:02+00:00",
        "fetched_at": "2025-09-27T01:52:24.293511+00:00",
        "category": "tech"
      },
      {
        "id": "cb292282a067",
        "title": "As people look for ways to make new friends, here are the apps promising to help",
        "url": "https://techcrunch.com/2025/09/26/as-people-look-for-ways-to-make-new-friends-here-are-the-apps-promising-to-help/",
        "description": "We've compiled a list of friendship apps, from friend discovery platforms like BFF to event-focused ones like Timeleft.",
        "source": "TechCrunch",
        "published": "2025-09-26T18:02:03+00:00",
        "fetched_at": "2025-09-27T01:52:24.293546+00:00",
        "category": "tech"
      },
      {
        "id": "a63f1f5add7d",
        "title": "More executives depart Hyundai’s air taxi startup Supernal",
        "url": "https://techcrunch.com/2025/09/26/more-executives-depart-hyundais-air-taxi-startup-supernal/",
        "description": "A wider leadership shake-up at Hyundai's electric air taxi startup Supernal is underway just a few weeks after it paused work on its vehicle program and its CEO and CTO left.",
        "source": "TechCrunch",
        "published": "2025-09-26T17:45:00+00:00",
        "fetched_at": "2025-09-27T01:52:24.293583+00:00",
        "category": "tech"
      },
      {
        "id": "67c51f266b47",
        "title": "Everyone’s still throwing billions at AI data centers",
        "url": "https://techcrunch.com/video/everyones-still-throwing-billions-at-ai-data-centers/",
        "description": "From $100 billion OpenAI commitments to $100,000 visa fees, this week showed just how much the tech landscape is shifting. On the latest episode of Equity, Anthony Ha and Max Zeff unpack the AI infrastructure gold rush and tech&#8217;s talent shuffle. Watch the full episode for more about:&#160;&#160; Equity is TechCrunch’s flagship podcast, produced by [&#8230;]",
        "source": "TechCrunch",
        "published": "2025-09-26T17:30:00+00:00",
        "fetched_at": "2025-09-27T01:52:24.293626+00:00",
        "category": "tech"
      },
      {
        "id": "048d92c2895d",
        "title": "TruSources to show off its on-device identity-checking tech at TechCrunch Disrupt 2025",
        "url": "https://techcrunch.com/2025/09/26/trusources-to-show-off-its-on-device-identity-checking-tech-at-techcrunch-disrupt-2025/",
        "description": "Age-verification laws are a privacy and security nightmare. This startup performs age checks on-device, without users having to upload their IDs to the internet.",
        "source": "TechCrunch",
        "published": "2025-09-26T16:09:41+00:00",
        "fetched_at": "2025-09-27T01:52:24.293686+00:00",
        "category": "tech"
      }
    ]
  },
  "finance": {
    "top_stories": [
      {
        "id": "7d9cee69ae41",
        "title": "Spirit Airlines is halting 40 routes, hires ex-Amazon network planning exec",
        "url": "https://www.cnbc.com/2025/09/26/spirit-airlines-routes-network-planning.html",
        "description": "Spirit said it is halting 40 routes to focus on stronger markets.",
        "source": "CNBC Finance",
        "published": "2025-09-26T20:12:51+00:00",
        "fetched_at": "2025-09-27T01:52:30.497862+00:00",
        "category": "finance",
        "scraped_content": "Spirit Airlines told staff Friday that it's suspending about 40 routes, finalizing a25% cutto its November schedule as it scrambles to slash costs inbankruptcyand focus on profitable flights. \"While the news has been tough, we believe the clarity will help us move forward as a team,\" Rana Ghosh, Spirit's chief commercial officer, said in a note to employees, which was seen by CNBC. Earlier this week Spirit said it plans tofurloughabout 1,800 flight attendants, around a third of its cabin crew members. Spirit filed for Chapter 11 bankruptcy protection last month for the second time in less than a year as itstruggledwith higher-than-expected costs and weaker travel demand than it projected. Spirit didn't immediately comment on the routes it is cutting, but Ghosh said in his note that Spirit will be halting service in Hartford, Connecticut, and Minneapolis. He also said Spirit has hired Andrea Lusso, who previously was the principal for supply chain and network design atAmazon Air, the online retailer's air shipment arm. Lusso will serve as vice president of network planning. His predecessor, John Kirby, retired last month after more than 40 years in the industry."
      },
      {
        "id": "fb3112bc0647",
        "title": "Sinclair, Nexstar will bring 'Jimmy Kimmel Live' back to owned ABC stations on Friday",
        "url": "https://www.cnbc.com/2025/09/26/sinclair-abc-jimmy-kimmel.html",
        "description": "Broadcast station owners Sinclair and Nexstar will begin airing \"Jimmy Kimmel Live!\" after three days of preempting the program since its return.",
        "source": "CNBC Finance",
        "published": "2025-09-26T21:07:19+00:00",
        "fetched_at": "2025-09-27T01:52:30.497909+00:00",
        "category": "finance",
        "scraped_content": "In this article SinclairandNexstarare returning \"Jimmy Kimmel Live!\" to ABC affiliate broadcast stations beginning Friday, the companies said in separate statements. The announcements come three days afterDisney'sABC broadcast networkreturnedthe late night program to its air after a nearly week-long suspension. Disney had temporarilysuspendedthe late night show following comments Kimmel made about the alleged murder of conservative activist Charlie Kirk and President Donald Trump's MAGA movement. \"Our objective throughout this process has been to ensure that programming remains accurate and engaging for the widest possible audience. We take seriously our responsibility as local broadcasters to provide programming that serves the interests of our communities, while also honoring our obligations to air national network programming,\" Sinclair said in a statement on Friday. \"Over the last week, we have received thoughtful feedback from viewers, advertisers, and community leaders representing a wide range of perspectives,\" Sinclair said. \"We have also witnessed troubling acts of violence, including the despicable incident of a shooting at an ABC affiliate station in Sacramento. These events underscore why responsible broadcasting matters and why respectful dialogue between differing voices remains so important."
      },
      {
        "id": "82a3deefa755",
        "title": "CDC takes down more than a dozen webpages on sexual and gender identity, health equity",
        "url": "https://www.cnbc.com/2025/09/26/cdc-webpages-on-sexual-gender-identity-health-equity-removed.html",
        "description": "Some health equity advocates say removing such resources could create gaps in access to critical health information, especially for marginalized groups.",
        "source": "CNBC Finance",
        "published": "2025-09-26T17:05:10+00:00",
        "fetched_at": "2025-09-27T01:52:30.497948+00:00",
        "category": "finance",
        "scraped_content": "More than a dozen pages on the Centers for Disease Control and Prevention website related to sexual and gender identity, health equity, and other topics have been taken down, CNBC has learned. The CDC received a directive from the Health and Human Services Department, which oversees the agency, to remove certain webpages by the end of the day Sept. 19, according to an internal CDC email viewed by CNBC, which was sent that day to some employees whose work is related to the pages. The pages include one about sexually transmitted infections and gay men, another about healthy equity for people with disabilities, and additional fact sheets on asexuality and bisexuality. Some health equity advocates say removing such resources could create gaps in access to critical health information, especially for marginalized groups, and undermine efforts to promote equitable care. The removal of \"critical materials from trusted government resources endangers the health of patients and the public,\" a spokesperson for theLBGT PA Caucus, a nonprofit promoting LGBTQ+ health-care equity, said in a statement. \"Stripping away resources on gender identity does not erase the need, it only erodes trust, creates confusion, and places patients at greater risk,\" the spokesperson said. \"Clinicians and the communities they serve rely on accessible, accurate, and inclusive guidance to deliver safe and effective care."
      },
      {
        "id": "20ae0f69e673",
        "title": "FAA to let Boeing sign off on 737 Maxes, 787s after years of restrictions",
        "url": "https://www.cnbc.com/2025/09/26/faa-boeing-737-max-787.html",
        "description": "Boeing can sign off on some of its 737 Max and 787 Dreamliner planes before they're handed over to customers, the FAA said Friday.",
        "source": "CNBC Finance",
        "published": "2025-09-26T18:07:58+00:00",
        "fetched_at": "2025-09-27T01:52:30.497985+00:00",
        "category": "finance",
        "scraped_content": "In this article Boeingcan sign off on some of its 737 Max and 787 Dreamliner planes before they're handed over to customers, the Federal Aviation Administration said Friday, the latest sign the manufacturer is regaining confidence from its regulator after years of safety crises. The FAA stopped allowing Boeing to issue its own airworthiness certificates for 737 Max airplanes in 2019 after two fatal crashes. It made a similar decision for Boeing 787s in 2022 because of production defects. Since the second Max crash, in March 2019, the FAA solely issued airworthiness certificates, which certify planes as safe to fly, for the Maxes. The FAA said that it and Boeing will issue the certificates on alternating weeks. \"Safety drives everything we do, and the FAA will only allow this step forward because we are confident it can be done safely,\" the FAA said in a statement. \"This decision follows a thorough review of Boeing's ongoing production quality and will allow our inspectors to focus additional surveillance in the production process. \" Boeing didn't immediately comment."
      },
      {
        "id": "2a5b19068642",
        "title": "'A broken business': The company behind the makeover of bankrupt retailer Claire's",
        "url": "https://www.cnbc.com/2025/09/26/ames-watson-tween-retailer-claires-rebuild.html",
        "description": "Pulled out of bankruptcy, Claire's is on track for a major makeover by private holding company Ames Watson.",
        "source": "CNBC Finance",
        "published": "2025-09-26T11:00:01+00:00",
        "fetched_at": "2025-09-27T01:52:30.498021+00:00",
        "category": "finance",
        "scraped_content": "Claire's is headed for a major makeover. The tween retailer, known for its ear piercing stations, jewelry and purple carpeting,declared bankruptcyin early August, thesecond timein seven years, citing nearly $500 million in debt and an increasingly competitive environment. Weeks later, private holding company Ames Watsonannouncedit was buying up roughly 1,000 Claire's stores across North America in a $140 million deal to rebuild the brand. The announcement paused the liquidation process at most Claire's stores. \"We went and started to do some very deep due diligence, and we came to the conclusion that this was a broken business, not a broken brand,\" Ames Watson co-founder Lawrence Berger told CNBC. Ames Watson's portfolio includes makeovers of other businesses, including hat retailer Lids and women's retailer South Moon Under. Berger said the company, which has more than $2 billion in revenue, thinks of itself as a \"mini Berkshire Hathaway,\" buying and transforming companies without any intentions of selling them. On top of its mounting debt, Claire's has been facing a multitude of challenges."
      }
    ],
    "quick_reads": [
      {
        "id": "bd5dfbdc992f",
        "title": "The global wealthy are lining up for Trump's $1 million Gold Card after price cut",
        "url": "https://www.cnbc.com/2025/09/26/trump-gold-card-visa-wealthy.html",
        "description": "Advisors to the ultra-wealthy said their clients are keen to access the U.S. education system, health care system, banking system and financial markets.",
        "source": "CNBC Finance",
        "published": "2025-09-26T16:47:15+00:00",
        "fetched_at": "2025-09-27T01:52:30.498061+00:00",
        "category": "finance"
      },
      {
        "id": "ab89cf41edd7",
        "title": "Family offices prefer to bet on AI boom with stocks versus startups and VC funds",
        "url": "https://www.cnbc.com/2025/09/26/family-offices-artificial-intelligence.html",
        "description": "Family offices were more likely to report investing in companies that use AI for productivity and efficiency or in other beneficiaries such as energy providers.",
        "source": "CNBC Finance",
        "published": "2025-09-26T11:30:01+00:00",
        "fetched_at": "2025-09-27T01:52:30.498096+00:00",
        "category": "finance"
      },
      {
        "id": "de097f7bb255",
        "title": "YouTube TV, NBCUniversal warn of impending carriage dispute that could lead to network blackout",
        "url": "https://www.cnbc.com/2025/09/25/youtube-tv-nbcuniversal-impending-carriage-dispute.html",
        "description": "YouTube TV and NBCUniversal may be heading toward a carriage dispute that could black out NBC programming such as \"Sunday Night Football\"",
        "source": "CNBC Finance",
        "published": "2025-09-26T17:23:52+00:00",
        "fetched_at": "2025-09-27T01:52:30.498133+00:00",
        "category": "finance"
      }
    ]
  }
}